Bunkering_04/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false; //true;

// --- Parameters for nested refinement boxes (edit only here) ---
refinementBoxesCfg
{
    nLevels        8;          // total number of boxes/levels
    scalingFactor  2;       // dx_i = dx_1 / scalingFactor^(i-1)

    // outermost box size (level 1)
    dx_level_1     5.0;        // [m]
    dy_level_1     5.0;        // [m]
    dz_level_1     35.2;       // [m]  (example: from z=6.95 up to ~42)

    zBase          6.8; //6.95;       // bottom z of all boxes
    namePrefix     "refinementBox_";  // base name
    nameSuffix     "xsmall";          // suffix
}

// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    bunkering-boat_m.stl
    {
        type triSurfaceMesh;
        name bunkering-boat_m;
    }

    bunkering-quay_m.stl
    {
        type triSurfaceMesh;
        name bunkering-quay_m;
    }

    bunkering-nozzle_up_m.stl
    {
        type triSurfaceMesh;
        name bunkering-nozzle_up_m;
    }

    refinementBox_gap
    {
        type box;
        min  (-120 0 0); //1.6 -1.6 6.95);
        max  ( 10  1 7); //11.75);
    }

    // --- Auto-generated nested refinement boxes ---
    #codeStream
    {
        code
        #{
            // Access top-level config correctly
            const dictionary& cfg = dict.parent().subDict("refinementBoxesCfg");

            const label  n     = readLabel(cfg.lookup("nLevels"));
            const scalar s     = readScalar(cfg.lookup("scalingFactor"));
            const scalar dx1   = readScalar(cfg.lookup("dx_level_1"));
            const scalar dy1   = readScalar(cfg.lookup("dy_level_1"));
            const scalar dz1   = readScalar(cfg.lookup("dz_level_1"));
            const scalar zBase = readScalar(cfg.lookup("zBase"));
            const word pre     = cfg.lookupOrDefault<word>("namePrefix","refinementBox_");
            const word suf     = cfg.lookupOrDefault<word>("nameSuffix","xsmall");

            for (label i = 1; i <= n; ++i)
            {
                const scalar powSi = pow(s, scalar(i-1));
                const scalar dx    = dx1 / powSi;
                const scalar dy    = dy1 / powSi;
                const scalar dz    = dz1 / powSi;

                const scalar xmin = -dx, ymin = -dy, zmin = zBase;
                const scalar xmax =  dx, ymax =  dy, zmax = zBase + dz;

                os  << "    " << pre << i << suf << "\n"
                    << "    {\n"
                    << "        type box;\n"
                    << "        min (" << xmin << " " << ymin << " " << zmin << ");\n"
                    << "        max (" << xmax << " " << ymax << " " << zmax << ");\n"
                    << "    }\n";
            }
        #};
    }
}  // <<< IMPORTANT: close geometry here


// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 200000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 2000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 0;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 3; //5;



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
            file "bunkering-boat_m.eMesh";
            level 1;
        }
        {
            file "bunkering-quay_m.eMesh";
            level 1;
        }
        {
            file "bunkering-nozzle_up_m.eMesh";
            level 6;
        }
    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        bunkering-boat_m
        {
            level (1 1);
        }
        bunkering-quay_m
        {
            level (1 1);
        }
        bunkering-nozzle_up_m
        {
            level (7 7);  //(5 6);
        }
    }

    resolveFeatureAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.
    refinementRegions
    {
        refinementBox_gap
        {
            mode inside;
            levels ((2 2));
        }

        #codeStream
        {
            code
            #{
                // refinementRegions -> castellatedMeshControls -> TOP
                const dictionary& cfg = dict.parent().parent().subDict("refinementBoxesCfg");

                const label n  = readLabel(cfg.lookup("nLevels"));
                const word pre = cfg.lookupOrDefault<word>("namePrefix","refinementBox_");
                const word suf = cfg.lookupOrDefault<word>("nameSuffix","xsmall");

                for (label i = 1; i <= n; ++i)
                {
                    os  << "    " << pre << i << suf << "\n"
                        << "    {\n"
                        << "        mode inside;\n"
                        << "        levels ((" << i << " " << i << "));\n"
                        << "    }\n";
                }
            #};
        }
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    // This is an outside point locationInMesh (-0.033 -0.033 0.0033);
    locationInMesh (0 0 10);


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces false;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 5; //3;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 1.5; //1.0; 

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 300; //500;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 10; //5;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 25; //10;

        //- Detect (geometric) features by sampling the surface
        implicitFeatureSnap true;

        //- Use castellatedMeshControls::features
        explicitFeatureSnap true; //false;

        //- Detect features between multiple surfaces
        //  (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap false; //true;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
    }

    // Expansion factor for layer mesh
    expansionRatio 1.0;


    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.25;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // See relativeSizes parameter.
    minThickness 0.2;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    nGrow 0;


    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    minMedialAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;

    // Max number of iterations after which relaxed meshQuality controls
    // get used. Up to nRelaxIter it uses the settings in meshQualityControls,
    // after nRelaxIter it uses the values in meshQualityControls::relaxed.
    nRelaxedIter 20;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"

    // Optional : some meshing phases allow usage of relaxed rules.
    // See e.g. addLayersControls::nRelaxedIter.
    relaxed
    {
        //- Maximum non-orthogonality allowed. Set to 180 to disable.
        maxNonOrtho 60; //75;
    }

    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- amount to scale back displacement at error points
    errorReduction 0.75;
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1E-6;


// ************************************************************************* //
